{
  "SUPPORTED_WINXPSP2": {
    "message": "Microsoft Windows XP SP2 atau lebih baharu",
    "description": "States the fact that this policy is only supported on XP SP2 and above"
  },
  "Cat_Mozilla": {
    "message": "Mozilla",
    "description": "The general category in the Group Policy Editor"
  },
  "Cat_LegacyBrowserSupport": {
    "message": "Sokongan Penyemak Imbas Lama",
    "description": "The specific category in the Group Policy Editor"
  },
  "AlternativeBrowserPath": {
    "message": "Laluan Penyemak Imbas Alternatif",
    "description": "Name of the AlternativeBrowserPath policy"
  },
  "AlternativeBrowserPath_Part": {
    "message": "Laluan Penyemak Imbas Alternatif",
    "description": "Name of the AlternativeBrowserPath policy part"
  },
  "AlternativeBrowserPath_Explain": {
    "message": "Menentukan fail boleh laku penyemak imbas alternatif.\nMembenarkan anda menentukan program untuk digunakan sebagai penyemak imbas alternatif.\n\nJika didayakan, anda boleh menentukan laluan yang muktamad dalam dasar atau menggunakan pemboleh ubah berikut:\n\n$${ie} - Lokasi pemasangan lalai untuk Internet Explorer\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\IEXPLORE.EXE digunakan untuk memilih lokasi penyemak imbas dalam kes ini.\n$${chrome} - Lokasi pemasangan lalai untuk Chrome\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\Chrome.EXE digunakan untuk memilih lokasi penyemak imbas dalam kes ini.\n$${safari} - Lokasi pemasangan lalai untuk Safari\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\SAFARI.EXE digunakan untuk memilih lokasi penyemak imbas dalam kes ini.\n\nJika dasar tidak didayakan atau dibiarkan kosong, penyemak imbas alternatif lalai akan digunakan, iaitu Internet Explorer dan ditentukan seolah-olah nilai $${ie} digunakan.",
    "description": "Explanation of the AlternativeBrowserPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "AlternativeBrowserArguments": {
    "message": "Argumen Penyemak Imbas Alternatif",
    "description": "Name of the AlternativeBrowserArguments policy"
  },
  "AlternativeBrowserArguments_Part": {
    "message": "Argumen Penyemak Imbas Alternatif",
    "description": "Name of the AlternativeBrowserArguments policy part"
  },
  "AlternativeBrowserArguments_Explain": {
    "message": "Membenarkan anda menentukan argumen yang perlu dihantar kepada fail boleh laku penyemak imbas alternatif.\n\nJika dasar ini didayakan, parameter yang diberikan akan digunakan apabila penyemak imbas alternatif dirujuk.\n\nAnda turut boleh menggunakan pemegang tempat khas $${url} untuk menentukan tempat url tersebut harus dipaparkan dalam baris perintah. Cth. \"--url=$${url} --kiosk\".\nPemegang tempat tidak perlu dinyatakan jika anda perlu melampirkannya di penghujung atau jika harus dijadikan satu-satunya argumen, anda boleh membiarkan dasar tersebut kosong.\n\nJika dasar ini dilumpuhkan atau dibiarkan kosong, hanya url akan dihantar sebagai parameter kepada penyemak imbas.",
    "description": "Explanation of the AlternativeBrowserArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxPath": {
    "message": "Laluan Firefox",
    "description": "Name of the FirefoxPath policy"
  },
  "FirefoxPath_Part": {
    "message": "Laluan Firefox",
    "description": "Name of the FirefoxPath policy part"
  },
  "FirefoxPath_Explain": {
    "message": "Membolehkan anda menentukan fail boleh laku Firefox untuk dilancarkan apabila kembali dari penyemak imbas alternatif(*).\n\nApabila dasar didayakan, anda boleh sama ada menentukan laluan yang muktamad dalam dasar atau menggunakan pemboleh ubah berikut:\n\n$${firefox} - Lokasi pemasangan lalai untuk Firefox\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\FIREFOX.EXE digunakan untuk memilih lokasi penyemak imbas dalam kes ini.\n\nJika dasar dilumpuhkan atau dibiarkan kosong, pemasangan lalai Firefox akan digunakan seolah-olah nilai $${firefox} telah digunakan.\n\n*: Pada masa ini hanya Internet Explorer menyokong tindakan kembali ke Firefox secara automatik.",
    "description": "Explanation of the FirefoxPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxArguments": {
    "message": "Argumen Firefox",
    "description": "Name of the FirefoxArguments policy"
  },
  "FirefoxArguments_Part": {
    "message": "Argumen Firefox",
    "description": "Name of the FirefoxArguments policy part"
  },
  "FirefoxArguments_Explain": {
    "message": "Membolehkan anda menentukan argumen yang perlu dihantar kepada Firefox apabila Firefox dilaksanakan.\n\nJika dasar didayakan, parameter yang diberikan akan digunakan apabila penyemak imbas alternatif dirujuk.\n\nAnda turut boleh menggunakan pemegang tempat khas $${url} untuk menentukan tempat url tersebut harus dipaparkan dalam baris arahan. Cth. \"--url=$${url} --kiosk\".\nPemegang tempat tidak perlu dinyatakan jika anda perlu melampirkannya di penghujung atau jika harus dijadikan satu-satunya argumen, anda boleh membiarkan dasar tersebut kosong.\n\nJika dasar ini dilumpuhkan atau dibiarkan kosong, hanya url akan dihantar sebagai parameter kepada penyemak imbas.",
    "description": "Explanation of the FirefoxArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "URLList_Policy": {
    "message": "Hos untuk Dibuka Dalam Penyemak Imbas Alternatif",
    "description": "Name of the URLList policy"
  },
  "URLList_Part": {
    "message": "Hos untuk Dibuka Dalam Penyemak Imbas Alternatif",
    "description": "Name of the URLList policy part"
  },
  "URLList_Explain": {
    "message": "Membenarkan anda menentukan senarai nama domain hos untuk dibuka dalam penyemak imbas Alternatif.\n\nJika dasar didayakan, anda perlu menyediakan senarai penapis yang akan mencetuskan peralihan ke penyemak imbas alternatif. Setiap entri mestilah salah satu daripada empat jenis berikut:\n\nBahagian nama hos: Sama ada nama domain lengkap seperti \"www.example.com\" mesti dinyatakan atau sebahagian daripadanya seperti \"example.com\" atau \"example\" sekalipun. Kad bebas belum disokong lagi.\nAwalan URL: Hanya awalan URL yang sesuai dipadankan lengkap dengan protokol dan port jika perlu. Cth. \"http://login.example.com\" atau \"https://www.example.com:8080/login/\".\nEntri negatif: Bermula dengan \"!\" dan berterusan sebagai bahagian nama hos atau awalan URL seperti diterangkan di atas. Entri negatif sentiasa dibuka dalam Firefox. Cth. \"!example.com\" atau \"!file:///c:/localapp/\".\nEntri kad bebas: Mengandungi hanya aksara \"*\" tunggal. Sepadan dengan mana-mana URL. Bertujuan untuk digunakan bersama-sama dengan entri negatif, jika kebanyakan URL harus dibuka dalam penyemak imbas alternatif dan hanya sejumlah kecil URL harus dibuka dalam Firefox.\n\nEntri negatif mempunyai keutamaan lebih tinggi berbanding entri positif yang membenarkan untuk membuat senarai putih bahagian besar domain sambil menyimpan bahagian yang lebih kecil untuk dibuka dalam Firefox.\nEntri kad bebas jika ada dipakai hanya selepas semua peraturan lain telah diperiksa.\n\nProtokol berikut dipantau untuk diubah hala: http:, https:.\n\nJika tidak dinyatakan atau dibiarkan kosong - tiada peralihan ke penyemak imbas alternatif akan dicetuskan.",
    "description": "Explanation of the URLList policy"
  },
  "URLGreyList_Policy": {
    "message": "Hos untuk Dibuka Dalam Mana-mana Penyemas Imbas",
    "description": "Name of the URLGreyList policy"
  },
  "URLGreyList_Part": {
    "message": "Hos untuk Dibuka Dalam Mana-mana Penyemak Imbas",
    "description": "Name of the URLGreyList policy part"
  },
  "URLGreyList_Explain": {
    "message": "Membolehkan anda menentukan senarai nama domain hos untuk dibuka dalam mana-mana penyemak imbas.\n\nJika dasar ini didayakan, domain dalam senarai ini akan tersedia dalam kedua-dua penyemak imbas dan tidak akan mencetuskan peralihan dengan mana-mana cara.\n\nKeadaan yang mungkin bagi kejadian ini ialah sebarang domain pengesahan yang dikongsi antara apl baharu dan lama dalam senarai ini.\n\nBahagian nama hos: Sama ada nama domain lengkap seperti \"www.example.com\" harus dinyatakan atau sebahagian daripadanya seperti \"example.com: malah \"example\". Kad bebas masih belum disokong.\nAwalan URL: Hanya awalan URL yang betul akan dipadankan lengkap dengan protokol dan port jika diperlukan. Cth. \"http://login.example.com\" atau \"https://www.example.com:8080/login/\".\n\nJika tidak ditentukan atau dibiarkan kosong - mana-mana domain yang tidak terdapat dalam senarai \"Hos untuk Dibuka Dalam Penyemak Imbas Alternatif\" akan mencetuskan peralihan kembali ke Firefox(*).\n\n*: Pada masa ini hanya Internet Explorer menyokong tindakan kembali ke Firefox secara automatik.",
    "description": "Explanation of the URLGreyList policy"
  },
  "KeepLastFirefoxTab_Policy": {
    "message": "Kekalkan Tab Firefox Terakhir Pada Peralihan",
    "description": "Name of the KeepLastFirefoxTab policy"
  },
  "KeepLastFirefoxTab_Part": {
    "message": "Kekalkan Tab Firefox Terakhir Pada Peralihan",
    "description": "Name of the KeepLastFirefoxTab part"
  },
  "KeepLastFirefoxTab_Explain": {
    "message": "Membenarkan anda menentukan perkara yang berlaku apabila tab terbuka terakhir dalam Firefox diubah hala ke penyemak imbas altenatif.\n\nApabila dasar ini didayakan atau tidak ditetapkan, tab terakhir akan dibiarkan terbuka dan mengarah ke halaman yang baharu selepas peralihan. Jika ditetapkan kepada dilumpuhkan, maka tab terakhir akan ditutup yang akan membawa kepada penutupan Firefox jika tiada tetingkap Firefox lain yang terbuka.",
    "description": "Explanation of the KeepLastFirefoxTab policy"
  },
  "ShowTransitionScreen_Policy": {
    "description": "Name of the ShowTransitionScreen policy",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Part": {
    "description": "Name of the ShowTransitionScreen policy part",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Explain": {
    "description": "Explanation of the ShowTransitionScreen policy",
    "message": "Allows you to specify how long the transition message in the tab will be visible in Firefox before transitioning to the other browser. This helps visualize the transition. The policy is specified in seconds.\n\nIf it is not set then the tab will be closed immediately when the transition can be completed."
  },
  "UseIeSiteList_Policy": {
    "description": "Name of the UseIeSiteList policy",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Part": {
    "description": "Name of the UseIeSiteList policy part",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Explain": {
    "description": "Explanation of the UseIeSiteList policy",
    "message": "When enabled, transitions between browsers will also be triggered by entries in the SiteList policy for Internet Explorer as defined in (https://technet.microsoft.com/itpro/internet-explorer/ie11-deploy-guide/turn-on-enterprise-mode-and-use-a-site-list).\n\nIf it is not set or disabled then only the urls in the extension policy will be used."
  }
}
