{
  "SUPPORTED_WINXPSP2": {
    "message": "Microsoft Windows XP SP2 nebo novější",
    "description": "States the fact that this policy is only supported on XP SP2 and above"
  },
  "Cat_Mozilla": {
    "message": "Mozilla",
    "description": "The general category in the Group Policy Editor"
  },
  "Cat_LegacyBrowserSupport": {
    "message": "Podpora starších prohlížečů",
    "description": "The specific category in the Group Policy Editor"
  },
  "AlternativeBrowserPath": {
    "message": "Cesta k alternativnímu prohlížeči",
    "description": "Name of the AlternativeBrowserPath policy"
  },
  "AlternativeBrowserPath_Part": {
    "message": "Cesta k alternativnímu prohlížeči",
    "description": "Name of the AlternativeBrowserPath policy part"
  },
  "AlternativeBrowserPath_Explain": {
    "message": "Zadejte spustitelný soubor alternativního prohlížeče.\nUmožňuje zadat, který program se má použít jako alternativní prohlížeč.\n\nPokud je tato zásada aktivována, můžete do ní buď zadat absolutní cestu, nebo použít jednu z následujících proměnných:\n\n$${ie} – V tomto případě se jako umístění prohlížeče použije výchozí umístění instalace prohlížeče Internet Explorer\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\IEXPLORE.EXE.\n$${chrome} – V tomto případě se jako umístění prohlížeče použije výchozí umístění instalace prohlížeče Chrome HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\Chrome.EXE.\n$${safari} – V tomto případě se jako umístění prohlížeče použije výchozí umístění instalace prohlížeče Safari HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\SAFARI.EXE.\n\nPokud tato zásada není aktivována nebo je ponechána prázdná, použije se výchozí alternativní prohlížeč – Internet Explorer v umístění, jako by byla použita hodnota $${ie}.",
    "description": "Explanation of the AlternativeBrowserPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "AlternativeBrowserArguments": {
    "message": "Argumenty alternativního prohlížeče",
    "description": "Name of the AlternativeBrowserArguments policy"
  },
  "AlternativeBrowserArguments_Part": {
    "message": "Argumenty alternativního prohlížeče",
    "description": "Name of the AlternativeBrowserArguments policy part"
  },
  "AlternativeBrowserArguments_Explain": {
    "message": "Umožňuje zadat argumenty, které mají být předány spustitelnému souboru alternativního prohlížeče.\n\nPokud je tato zásada povolena, budou při volání alternativního prohlížeče použity zadané parametry.\n\nPomocí speciálního zástupného symbolu $${url} můžete určit, kde má být v příkazovém řádku uvedena adresa URL. Příklad: „--url=$${url} --kiosk“.\nPokud má být adresa URL přidána na konec nebo pokud je adresa URL jediným argumentem, tento zástupný symbol uvádět nemusíte.\n\nPokud je tato zásada deaktivována nebo ponechána prázdná, bude prohlížeči jako parametr předána pouze adresa URL.",
    "description": "Explanation of the AlternativeBrowserArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxPath": {
    "message": "Cesta k prohlížeči Firefox",
    "description": "Name of the FirefoxPath policy"
  },
  "FirefoxPath_Part": {
    "message": "Cesta k prohlížeči Firefox",
    "description": "Name of the FirefoxPath policy part"
  },
  "FirefoxPath_Explain": {
    "message": "Umožňuje zadat spustitelný soubor Chromu, který se má spustit při návratu z alternativního prohlížeče(*).\n\nPokud je tato zásada aktivována, můžete v ní buď uvést absolutní cestu, nebo použít následující proměnnou:\n\n$${firefox} – V tomto případě se použije výchozí umístění instalace prohlížeče Firefox\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\FIREFOX.EXE.\n\nPokud je tato zásada deaktivována nebo je ponechána prázdná, použije se výchozí umístění instalace prohlížeče Firefox, stejně jako by byla použita hodnota $${firefox}.\n\n*: V současné době podporuje automatický návrat do Chromu pouze prohlížeč Internet Explorer.",
    "description": "Explanation of the FirefoxPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxArguments": {
    "message": "Argumenty prohlížeče Firefox",
    "description": "Name of the FirefoxArguments policy"
  },
  "FirefoxArguments_Part": {
    "message": "Argumenty prohlížeče Firefox",
    "description": "Name of the FirefoxArguments policy part"
  },
  "FirefoxArguments_Explain": {
    "message": "Umožňuje zadat argumenty, které budou při spuštění předány Chromu.\n\nPokud je tato zásada povolena, budou při spuštění Chromu použity zadané parametry.\n\nPomocí speciálního zástupného symbolu $${url} můžete určit, kde má být v příkazovém řádku uvedena adresa URL. Příklad: „--url=$${url} --kiosk“.\nPokud má být adresa URL přidána na konec nebo pokud je adresa URL jediným argumentem, tento zástupný symbol uvádět nemusíte.\n\nPokud je tato zásada deaktivována nebo ponechána prázdná, bude jako parametr prohlížeči předána pouze adresa URL.",
    "description": "Explanation of the FirefoxArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "URLList_Policy": {
    "message": "Hostitelské servery, které se mají otevřít v alternativním prohlížeči",
    "description": "Name of the URLList policy"
  },
  "URLList_Part": {
    "message": "Hostitelské servery, které se mají otevřít v alternativním prohlížeči",
    "description": "Name of the URLList policy part"
  },
  "URLList_Explain": {
    "message": "Umožňuje zadat seznam názvů domén hostitelských serverů, které se mají otevřít v alternativním prohlížeči.\n\nPokud je tato zásada povolena, je třeba zadat seznam filtrů, které spustí přechod na alternativní prohlížeč. Každý záznam by měl být některý z následujících čtyř typů:\n\nČást názvu hostitele: Je třeba uvést buď úplné názvy domén (například „www.example.cz“), nebo jejich části (například „example.cz“ nebo dokonce jen „example“). Zástupné znaky zatím nejsou podporovány.\nPředpona adresy URL: Odpovídat budou pouze správné předpony adres URL včetně protokolu a portu (pokud je potřeba). Příklad: „http://login.example.cz“ nebo „https://www.example.cz:8080/login/“.\nVylučující záznam: Začíná znakem „!“ a pokračuje jako část názvu hostitele nebo předpona adresy URL, jak je uvedeno výše. Vylučující záznamy se vždy otevírají v Chromu. Příklad: „!example.cz“ nebo „!file:///c:/localapp/“.\nZáznam se zástupným symbolem: Obsahuje pouze jeden znak „*“. Odpovídá libovolné adrese URL. Je určen k použití společně s vylučujícími záznamy v případě, že by se většina adres URL měla otevírat v alternativním prohlížeči a pouze malá část adres URL by se měla otevírat v Chromu.\n\nVylučující záznamy mají menší prioritu než pozitivní záznamy. Lze tak velké části domény uvést na seznamu povolených a přitom pro menší části ponechat otevírání v Chromu.\nZáznam se zástupným symbolem (pokud je uveden) bude použit až poté, co byla zkontrolována všechna ostatní pravidla.\n\nPřesměrování je sledováno u následujících protokolů: http:, https:.\n\nPokud tato zásada není zadána nebo je ponechána prázdná, přechod na alternativní prohlížeč nebude aktivován.",
    "description": "Explanation of the URLList policy"
  },
  "URLGreyList_Policy": {
    "message": "Hostitelské servery, které se mohou otevírat v obou prohlížečích",
    "description": "Name of the URLGreyList policy"
  },
  "URLGreyList_Part": {
    "message": "Hostitelské servery, které se mohou otevírat v obou prohlížečích",
    "description": "Name of the URLGreyList policy part"
  },
  "URLGreyList_Explain": {
    "message": "Umožňuje zadat seznam názvů domén hostitelských serverů, které se mohou otevírat v obou prohlížečích.\n\nPokud je tato zásada aktivována, domény v tomto seznamu budou k dispozici v obou prohlížečích a nebudou spouštět přechod ani jedním směrem.\n\nTento seznam lze použít například pro ověřovací domény, které jsou sdíleny mezi novými i starými aplikacemi v tomto seznamu.\n\nČásti názvu hostitele: Je třeba uvést buď úplné názvy domén (například „www.example.cz“), nebo jejich části (například „example.cz“ nebo dokonce jen „example“). Zástupné znaky zatím nejsou podporovány.\nPředpony adres URL: Odpovídat budou pouze správné předpony adres URL včetně protokolu a portu (pokud je potřeba). Příklad: „http://login.example.cz“ nebo „https://www.example.cz:8080/login/“.\n\nPokud tato zásada není zadána nebo je seznam ponechán prázdný, každá doména, která není uvedena v seznamu „Hostitelské servery, které se mají otevřít v alternativním prohlížeči“, spustí přechod zpět do Chromu(*).\n\n*: V současné době podporuje automatický návrat do Chromu pouze prohlížeč Internet Explorer.",
    "description": "Explanation of the URLGreyList policy"
  },
  "KeepLastFirefoxTab_Policy": {
    "message": "Při přechodu v Chromu zachovat naposledy otevřenou kartu",
    "description": "Name of the KeepLastFirefoxTab policy"
  },
  "KeepLastFirefoxTab_Part": {
    "message": "Při přechodu v Chromu zachovat naposledy otevřenou kartu",
    "description": "Name of the KeepLastFirefoxTab part"
  },
  "KeepLastFirefoxTab_Explain": {
    "message": "Umožňuje zadat, co se stane, když je naposledy otevřená karta v Chromu přesměrována na alternativní prohlížeč.\n\nPokud je tato zásada aktivována nebo není nastavena, bude poslední karta ponechána otevřená a bude po přechodu ukazovat na stránku Nová karta. Pokud je v této zásadě nastaveno zakázání, poslední karta bude zavřena. Pokud v Chromu nejsou otevřena žádná jiná okna, povede to k zavření Chromu.",
    "description": "Explanation of the KeepLastFirefoxTab policy"
  },
  "ShowTransitionScreen_Policy": {
    "description": "Name of the ShowTransitionScreen policy",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Part": {
    "description": "Name of the ShowTransitionScreen policy part",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Explain": {
    "description": "Explanation of the ShowTransitionScreen policy",
    "message": "Allows you to specify how long the transition message in the tab will be visible in Firefox before transitioning to the other browser. This helps visualize the transition. The policy is specified in seconds.\n\nIf it is not set then the tab will be closed immediately when the transition can be completed."
  },
  "UseIeSiteList_Policy": {
    "description": "Name of the UseIeSiteList policy",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Part": {
    "description": "Name of the UseIeSiteList policy part",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Explain": {
    "description": "Explanation of the UseIeSiteList policy",
    "message": "When enabled, transitions between browsers will also be triggered by entries in the SiteList policy for Internet Explorer as defined in (https://technet.microsoft.com/itpro/internet-explorer/ie11-deploy-guide/turn-on-enterprise-mode-and-use-a-site-list).\n\nIf it is not set or disabled then only the urls in the extension policy will be used."
  }
}
