{
  "SUPPORTED_WINXPSP2": {
    "message": "Microsoft Windows XP z dodatkiem SP2 lub nowszy",
    "description": "States the fact that this policy is only supported on XP SP2 and above"
  },
  "Cat_Mozilla": {
    "message": "Mozilla",
    "description": "The general category in the Group Policy Editor"
  },
  "Cat_LegacyBrowserSupport": {
    "message": "Obsługa starszych przeglądarek",
    "description": "The specific category in the Group Policy Editor"
  },
  "AlternativeBrowserPath": {
    "message": "Ścieżka alternatywnej przeglądarki",
    "description": "Name of the AlternativeBrowserPath policy"
  },
  "AlternativeBrowserPath_Part": {
    "message": "Ścieżka alternatywnej przeglądarki",
    "description": "Name of the AlternativeBrowserPath policy part"
  },
  "AlternativeBrowserPath_Explain": {
    "message": "Określ plik wykonywalny alternatywnej przeglądarki.\nPozwala określić program, który będzie używany jako alternatywna przeglądarka.\n\nJeśli ta zasada jest włączona, możesz podać w niej ścieżkę bezwzględną lub użyć jednej z tych zmiennych:\n\n$${ie} – domyślna lokalizacja, w której jest zainstalowany Internet Explorer.\nW tym przypadku do wskazania lokalizacji przeglądarki jest używany ten wpis w rejestrze: HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\IEXPLORE.EXE.\n$${chrome} – domyślna lokalizacja, w której jest zainstalowany Chrome.\nW tym przypadku do wskazania lokalizacji przeglądarki jest używany ten wpis w rejestrze: HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\Chrome.EXE.\n$${safari} – domyślna lokalizacja, w której jest zainstalowany Safari.\nW tym przypadku do wskazania lokalizacji przeglądarki jest używany ten wpis w rejestrze:\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\SAFARI.EXE.\n\nJeśli zasada nie będzie włączona lub pozostanie pusta, zostanie użyta domyślna przeglądarka alternatywna – czyli Internet Explorer przy założeniu, że podano wartość $${ie}.",
    "description": "Explanation of the AlternativeBrowserPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "AlternativeBrowserArguments": {
    "message": "Argumenty alternatywnej przeglądarki",
    "description": "Name of the AlternativeBrowserArguments policy"
  },
  "AlternativeBrowserArguments_Part": {
    "message": "Argumenty alternatywnej przeglądarki",
    "description": "Name of the AlternativeBrowserArguments policy part"
  },
  "AlternativeBrowserArguments_Explain": {
    "message": "Pozwala określić argumenty, które zostaną przekazane do pliku wykonywalnego alternatywnej przeglądarki.\n\nJeśli ta zasada będzie włączona, podane parametry zostaną użyte w momencie wywołania alternatywnej przeglądarki.\n\nMożesz też wstawić specjalny symbol zastępczy $${url}, by określić, gdzie powinien pojawić się URL w wierszu polecenia. Przykład: „--url=$${url} --kiosk”.\nNie musisz podawać tego symbolu zastępczego, jeśli ma zostać wstawiony na końcu lub ma być jedynym argumentem – zasada może wtedy pozostać pusta.\n\nJeśli ta zasada będzie wyłączona lub pusta, jedynym parametrem przekazanym do przeglądarki będzie URL.",
    "description": "Explanation of the AlternativeBrowserArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxPath": {
    "message": "Ścieżka Firefox",
    "description": "Name of the FirefoxPath policy"
  },
  "FirefoxPath_Part": {
    "message": "Ścieżka Firefox",
    "description": "Name of the FirefoxPath policy part"
  },
  "FirefoxPath_Explain": {
    "message": "Pozwala określić plik wykonywalny Firefox, który zostanie otwarty po powrocie z alternatywnej przeglądarki*.\n\nKiedy ta zasada jest włączona, możesz podać w niej ścieżkę bezwzględną lub użyć tej zmiennej:\n\n$${firefox} – domyślna lokalizacja, w której jest zainstalowany Firefox.\nW tym przypadku do wskazania lokalizacji przeglądarki jest używany ten wpis w rejestrze: HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\FIREFOX.EXE.\n\nJeśli ta zasada będzie wyłączona lub pusta, zostanie użyta domyślna instalacja Firefox – tak jakby była podana wartość $${firefox}.\n\n* Obecnie tylko Internet Explorer obsługuje automatyczny powrót do Firefox.",
    "description": "Explanation of the FirefoxPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxArguments": {
    "message": "Argumenty Firefox",
    "description": "Name of the FirefoxArguments policy"
  },
  "FirefoxArguments_Part": {
    "message": "Argumenty Firefox",
    "description": "Name of the FirefoxArguments policy part"
  },
  "FirefoxArguments_Explain": {
    "message": "Pozwala określić argumenty, które zostaną przekazane do Firefox w momencie jego uruchomienia.\n\nJeśli ta zasada będzie włączona, podane parametry zostaną użyte w momencie wywołania Firefox.\n\nMożesz też wstawić specjalny symbol zastępczy $${url}, by określić, gdzie powinien pojawić się URL w wierszu polecenia. Przykład: „--url=$${url} --kiosk”.\nNie musisz podawać tego symbolu zastępczego, jeśli ma zostać wstawiony na końcu lub ma być jedynym argumentem – zasada może wtedy pozostać pusta.\n\nJeśli ta zasada będzie wyłączona lub pusta, jedynym parametrem przekazanym do przeglądarki będzie URL.",
    "description": "Explanation of the FirefoxArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "URLList_Policy": {
    "message": "Hosty, które zostaną otwarte w alternatywnej przeglądarce",
    "description": "Name of the URLList policy"
  },
  "URLList_Part": {
    "message": "Hosty, które zostaną otwarte w alternatywnej przeglądarce",
    "description": "Name of the URLList policy part"
  },
  "URLList_Explain": {
    "message": "Pozwala określić listę nazw domen, które zostaną otwarte w alternatywnej przeglądarce.\n\nJeśli ta zasada jest włączona, musisz podać listę filtrów, które uruchomią przejście na alternatywną przeglądarkę. Każdy wpis powinien należeć do jednego z tych czterech typów:\n\nNazwa hosta – mogą to być pełne nazwy domen (np. „www.example.com”) lub ich fragmenty (np. „example.com”, a nawet samo „example”). Symbole wieloznaczne nie są jeszcze obsługiwane.\nPrefiks URL – można podać tylko właściwe przedrostki URL, w razie potrzeby wraz z protokołem lub portem (np. „http://login.example.com” lub „https://www.example.com:8080/login/”).\nWpis ujemny – zaczyna się od „!” i w dalszej części zawiera nazwę hosta lub prefiks URL (jak opisano wyżej). Wpisy ujemne są zawsze otwierane w Firefox. Przykład: „!example.com” lub „!file:///c:/localapp/”.\nWpis zawierający symbol wieloznaczny – zawiera tylko pojedynczy znak „*”. Pasuje do każdego URL-a. Jest przeznaczony do użycia z wpisami ujemnymi, w przypadku, gdy większość URL-i ma zostać otwarta w alternatywnej przeglądarce, a tylko niektóre z nich w Firefox.\n\nWpisy ujemne mają wyższy priorytet niż dodatnie, co pozwala dodać do białej listy duże części domeny, podczas gdy jej mniejsze części są otwierane w Firefox.\nWpis zawierający symbol wieloznaczny (jeśli jest obecny) jest używany tylko wtedy, gdy wszystkie pozostałe zasady zostały sprawdzone.\n\nOto protokoły monitorowane pod kątem przekierowania: http:, https:.\n\nJeśli ta zasada nie jest określona lub pozostaje pusta, przejście na alternatywną przeglądarkę nie zostanie uruchomione.",
    "description": "Explanation of the URLList policy"
  },
  "URLGreyList_Policy": {
    "message": "Hosty, które zostaną otwarte w jednej z przeglądarek",
    "description": "Name of the URLGreyList policy"
  },
  "URLGreyList_Part": {
    "message": "Hosty, które zostaną otwarte w jednej z przeglądarek",
    "description": "Name of the URLGreyList policy part"
  },
  "URLGreyList_Explain": {
    "message": "Pozwala określić listę nazw domen, które zostaną otwarte w jednej z przeglądarek.\n\nKiedy ta zasada jest włączona, domeny na tej liście będą dostępne w obu przeglądarkach i nie spowoduje to przełączenia na inną przeglądarkę.\n\nMożliwe przypadki zastosowania dotyczą domen uwierzytelniania, które są używane jednocześnie przez nowsze i starsze aplikacje z listy.\n\nNazwy hostów – mogą to być pełne nazwy domen (np. „www.example.com”) lub ich fragmenty (np. „example.com”, a nawet samo „example”). Symbole wieloznaczne nie są jeszcze obsługiwane.\nPrefiksy URL – można podać tylko właściwe prefiksy URL, w razie potrzeby wraz z protokołem lub portem (np. „http://login.example.com” lub „https://www.example.com:8080/login/”).\n\nJeśli domeny nie zostaną określone lub zasada pozostanie pusta, każda domena spoza listy „Hosty, które zostaną otwarte w alternatywnej przeglądarce” spowoduje powrót do Firefox*.\n\n* Obecnie tylko Internet Explorer obsługuje automatyczny powrót do Firefox.",
    "description": "Explanation of the URLGreyList policy"
  },
  "KeepLastFirefoxTab_Policy": {
    "message": "Podczas przejścia zachowaj ostatnio otwartą kartę Firefox",
    "description": "Name of the KeepLastFirefoxTab policy"
  },
  "KeepLastFirefoxTab_Part": {
    "message": "Podczas przejścia zachowaj ostatnio otwartą kartę Firefox",
    "description": "Name of the KeepLastFirefoxTab part"
  },
  "KeepLastFirefoxTab_Explain": {
    "message": "Pozwala określić, co się stanie, gdy ostatnia karta otwarta w Firefox zostanie przekierowana do alternatywnej przeglądarki.\n\nGdy ta zasada jest włączona lub nie jest ustawiona, ostatnia karta pozostanie otwarta i po przejściu będzie się odwoływać do strony nowej karty. Jeśli ta zasada jest wyłączona, ostatnia karta zostanie zamknięta, co spowoduje zamknięcie Firefox, jeśli żadne inne okna Firefox nie są otwarte.",
    "description": "Explanation of the KeepLastFirefoxTab policy"
  },
  "ShowTransitionScreen_Policy": {
    "description": "Name of the ShowTransitionScreen policy",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Part": {
    "description": "Name of the ShowTransitionScreen policy part",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Explain": {
    "description": "Explanation of the ShowTransitionScreen policy",
    "message": "Allows you to specify how long the transition message in the tab will be visible in Firefox before transitioning to the other browser. This helps visualize the transition. The policy is specified in seconds.\n\nIf it is not set then the tab will be closed immediately when the transition can be completed."
  },
  "UseIeSiteList_Policy": {
    "description": "Name of the UseIeSiteList policy",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Part": {
    "description": "Name of the UseIeSiteList policy part",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Explain": {
    "description": "Explanation of the UseIeSiteList policy",
    "message": "When enabled, transitions between browsers will also be triggered by entries in the SiteList policy for Internet Explorer as defined in (https://technet.microsoft.com/itpro/internet-explorer/ie11-deploy-guide/turn-on-enterprise-mode-and-use-a-site-list).\n\nIf it is not set or disabled then only the urls in the extension policy will be used."
  }
}
