{
  "SUPPORTED_WINXPSP2": {
    "message": "Microsoft Windows XP SP2 ή νεότερη έκδοση",
    "description": "States the fact that this policy is only supported on XP SP2 and above"
  },
  "Cat_Mozilla": {
    "message": "Mozilla",
    "description": "The general category in the Group Policy Editor"
  },
  "Cat_LegacyBrowserSupport": {
    "message": "Υποστήριξη προγράμματος περιήγησης παλαιού τύπου",
    "description": "The specific category in the Group Policy Editor"
  },
  "AlternativeBrowserPath": {
    "message": "Διαδρομή εναλλακτικού προγράμματος περιήγησης",
    "description": "Name of the AlternativeBrowserPath policy"
  },
  "AlternativeBrowserPath_Part": {
    "message": "Διαδρομή εναλλακτικού προγράμματος περιήγησης",
    "description": "Name of the AlternativeBrowserPath policy part"
  },
  "AlternativeBrowserPath_Explain": {
    "message": "Προσδιορίστε το εκτελέσιμο του εναλλακτικού προγράμματος περιήγησης.\nΣας δίνει τη δυνατότητα να ορίσετε το πρόγραμμα που θα χρησιμοποιηθεί ως εναλλακτικό πρόγραμμα περιήγησης.\n\nΕάν ενεργοποιηθεί μπορείτε είτε να προσδιορίσετε μια απόλυτη διαδρομή στην πολιτική είτε να χρησιμοποιήσετε μία από τις παρακάτω μεταβλητές:\n\n$${ie} - Η προεπιλεγμένη τοποθεσία εγκατάστασης για τον Internet Explorer\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\IEXPLORE.EXE χρησιμοποιείται για την επιλογή της τοποθεσίας του προγράμματος περιήγησης σε αυτήν την περίπτωση.\n$${chrome} - Η προεπιλεγμένη τοποθεσία εγκατάστασης για το Chrome\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\Chrome.EXE χρησιμοποιείται για την επιλογή της τοποθεσίας του προγράμματος περιήγησης σε αυτήν την περίπτωση.\n$${safari} - Η προεπιλεγμένη τοποθεσία εγκατάστασης για το Safari\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\SAFARI.EXE χρησιμοποιείται για την επιλογή της τοποθεσίας του προγράμματος περιήγησης σε αυτήν την περίπτωση.\n\nΕάν η πολιτική απενεργοποιηθεί ή παραμείνει κενή θα χρησιμοποιηθεί το προεπιλεγμένο εναλλακτικό πρόγραμμα περιήγησης το οποίο είναι το Internet Explorer που καθορίζεται σαν να χρησιμοποιείται η τιμή $${ie}.",
    "description": "Explanation of the AlternativeBrowserPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "AlternativeBrowserArguments": {
    "message": "Ορίσματα εναλλακτικού προγράμματος περιήγησης",
    "description": "Name of the AlternativeBrowserArguments policy"
  },
  "AlternativeBrowserArguments_Part": {
    "message": "Ορίσματα εναλλακτικού προγράμματος περιήγησης",
    "description": "Name of the AlternativeBrowserArguments policy part"
  },
  "AlternativeBrowserArguments_Explain": {
    "message": "Σας δίνει τη δυνατότητα να προσδιορίσετε τα ορίσματα που θα μεταβιβάζονται στο εκτελέσιμο του εναλλακτικού προγράμματος περιήγησης.\n\nΕάν ενεργοποιηθεί η πολιτική, θα χρησιμοποιούνται οι παρεχόμενες παράμετροι κατά την επίκληση του εναλλακτικού προγράμματος περιήγησης.\n\nΜπορείτε επίσης να χρησιμοποιήσετε το ειδικό σύμβολο κράτησης θέσης $${url} για να προσδιορίσετε την τοποθεσία στην οποία θα πρέπει να εμφανίζεται η διεύθυνση URL στη γραμμή εντολών. Για παράδειγμα \"--url=$${url} --kiosk\".\nΔεν χρειάζεται να προσδιορίσετε το σύμβολο κράτησης θέσης εάν πρέπει να προσαρτηθεί στο τέλος ή εάν πρέπει να αποτελεί το μοναδικό όρισμα, μπορείτε να αφήσετε αυτήν την πολιτική κενή.\n\nΕάν η πολιτική απενεργοποιηθεί ή παραμείνει κενή μόνο η διεύθυνση URL θα μεταβιβαστεί ως παράμετρος στο πρόγραμμα περιήγησης.",
    "description": "Explanation of the AlternativeBrowserArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxPath": {
    "message": "Διαδρομή Firefox",
    "description": "Name of the FirefoxPath policy"
  },
  "FirefoxPath_Part": {
    "message": "Διαδρομή Firefox",
    "description": "Name of the FirefoxPath policy part"
  },
  "FirefoxPath_Explain": {
    "message": "Σας δίνει τη δυνατότητα να ορίσετε το εκτελέσιμο του Firefox που θα εκκινείται κατά την επιστροφή από το εναλλακτικό πρόγραμμα περιήγησης(*).\n\nΌταν είναι ενεργοποιημένη η πολιτική, μπορείτε είτε να προσδιορίσετε μια απόλυτη διαδρομή στην πολιτική είτε να χρησιμοποιήσετε μία από τις παρακάτω μεταβλητές:\n\n$${firefox} - Η προεπιλεγμένη τοποθεσία εγκατάστασης για το Firefox\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\FIREFOX.EXE χρησιμοποιείται για την επιλογή της τοποθεσίας του προγράμματος περιήγησης σε αυτήν την περίπτωση.\n\nΕάν η πολιτική απενεργοποιηθεί ή παραμείνει κενή θα χρησιμοποιηθεί η προεπιλεγμένη εγκατάσταση του Firefox σαν να χρησιμοποιείται η τιμή $${firefox}.\n\n*: Προς το παρόν μόνο ο Internet Explorer υποστηρίζει την αυτόματη επιστροφή από το Firefox.",
    "description": "Explanation of the FirefoxPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "FirefoxArguments": {
    "message": "Ορίσματα Firefox",
    "description": "Name of the FirefoxArguments policy"
  },
  "FirefoxArguments_Part": {
    "message": "Ορίσματα Firefox",
    "description": "Name of the FirefoxArguments policy part"
  },
  "FirefoxArguments_Explain": {
    "message": "Σας δίνει τη δυνατότητα να προσδιορίσετε τα ορίσματα που θα μεταβιβάζονται στο Firefox κατά την εκτέλεσή του.\n\nΕάν ενεργοποιηθεί η πολιτική θα χρησιμοποιούνται οι παρεχόμενες παράμετροι κατά την επίκληση του Firefox.\n\nΜπορείτε επίσης να χρησιμοποιήσετε το ειδικό σύμβολο κράτησης θέσης $${url} για να προσδιορίσετε την τοποθεσία στην οποία θα πρέπει να εμφανίζεται η διεύθυνση URL στη γραμμή εντολών. Για παράδειγμα \"--url=$${url} --kiosk\".\nΔεν χρειάζεται να προσδιορίσετε το σύμβολο κράτησης θέσης εάν πρέπει να προσαρτηθεί στο τέλος ή εάν πρέπει να αποτελεί το μοναδικό όρισμα, μπορείτε να αφήσετε αυτήν την πολιτική κενή.\n\n\nΕάν η πολιτική απενεργοποιηθεί ή παραμείνει κενή μόνο η διεύθυνση URL θα μεταβιβαστεί ως παράμετρος στο πρόγραμμα περιήγησης.",
    "description": "Explanation of the FirefoxArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "URLList_Policy": {
    "message": "Κεντρικοί υπολογιστές για άνοιγμα στο εναλλακτικό πρόγραμμα περιήγησης",
    "description": "Name of the URLList policy"
  },
  "URLList_Part": {
    "message": "Κεντρικοί υπολογιστές για άνοιγμα στο εναλλακτικό πρόγραμμα περιήγησης",
    "description": "Name of the URLList policy part"
  },
  "URLList_Explain": {
    "message": "Σας δίνει τη δυνατότητα να προσδιορίσετε μια λίστα ονομάτων τομέα των κεντρικών υπολογιστών που θα ανοίγουν στο εναλλακτικό πρόγραμμα περιήγησης.\n\nΕάν ενεργοποιηθεί η πολιτική, θα πρέπει να καταχωρίσετε μια λίστα φίλτρων που θα οδηγούν σε μετάβαση στο εναλλακτικό πρόγραμμα περιήγησης. Κάθε καταχώριση θα πρέπει να έχει έναν από τους ακόλουθους τέσσερις τύπους:\n\nΤμήμα ονόματος κεντρικού υπολογιστή: Θα πρέπει να προσδιοριστούν είτε πλήρη ονόματα τομέων όπως \"www.example.com\" είτε τμήματά τους, όπως \"example.com\" ή ακόμη \"example\". Οι χαρακτήρες-μπαλαντέρ δεν υποστηρίζονται ακόμη.\nΠρόθεμα URL: Γίνεται πλήρης αντιστοίχιση μόνο των κατάλληλων προθεμάτων URL με το πρωτόκολλο και τη θύρα, εφόσον κρίνεται απαραίτητο. Π.χ. \"http://login.example.com\" ή \"https://www.example.com:8080/login/\".\nΑρνητική καταχώριση: Ξεκινά με το στοιχείο \"!\"και συνεχίζει ως τμήμα ονόματος κεντρικού υπολογιστή ή πρόθεμα διεύθυνσης URL, όπως περιγράφεται παραπάνω. Οι αρνητικές καταχωρίσεις ανοίγουν πάντα στο Firefox. Π.χ. \"!example.com\" ή \"!file:///c:/localapp/\".\nΚαταχώριση με χαρακτήρα-μπαλαντέρ: Περιέχει μόνο έναν χαρακτήρα \"*\". Αντιστοιχεί σε οποιαδήποτε διεύθυνση URL. Προορίζεται για χρήση με αρνητικές καταχωρίσεις, εάν πρέπει να είναι ανοικτές περισσότερες διευθύνσεις URL στο εναλλακτικό πρόγραμμα περιήγησης και μόνο μια μικρή επιλογή διευθύνσεων URL θα πρέπει να ανοίξουν στο Firefox.\n\nΟι αρνητικές καταχωρίσεις έχουν υψηλότερη προτεραιότητα από τις θετικές καταχωρίσεις, κάτι που επιτρέπει την προσθήκη σε λίστα επιτρεπόμενων μεγάλων τμημάτων ενός τομέα, ενώ θα γίνεται αποθήκευση μικρότερων τμημάτων στο Firefox.\nΗ καταχώριση με χαρακτήρες-μπαλαντέρ εφόσον υπάρχει, εφαρμόζεται μόνο μετά τον έλεγχο όλων των άλλων κανόνων.\n\nΤα παρακάτω πρωτόκολλα παρακολουθούνται για ανακατεύθυνση: http:, https:.\n\nΕάν δεν προσδιοριστεί ή παραμείνει κενή, δεν θα γίνει μετάβαση στο εναλλακτικό πρόγραμμα περιήγησης.",
    "description": "Explanation of the URLList policy"
  },
  "URLGreyList_Policy": {
    "message": "Κεντρικοί υπολογιστές για άνοιγμα σε οποιοδήποτε πρόγραμμα περιήγησης",
    "description": "Name of the URLGreyList policy"
  },
  "URLGreyList_Part": {
    "message": "Κεντρικοί υπολογιστές για άνοιγμα σε οποιοδήποτε πρόγραμμα περιήγησης",
    "description": "Name of the URLGreyList policy part"
  },
  "URLGreyList_Explain": {
    "message": "Σας δίνει τη δυνατότητα να προσδιορίσετε μια λίστα των ονομάτων τομέων των κεντρικών υπολογιστών που θα ανοίγει οποιοδήποτε από τα προγράμματα περιήγησης.\n\nΌταν είναι ενεργοποιημένη αυτή η πολιτική, οι τομείς σε αυτήν τη λίστα θα είναι διαθέσιμοι και στα δύο προγράμματα περιήγησης και δεν θα προκαλείται μετάβαση με οποιοδήποτε τρόπο.\n\nΜια πιθανή περίπτωση χρήσης αποτελούν τυχόν κοινόχρηστοι τομείς επαλήθευσης μεταξύ των νέων εφαρμογών και των εφαρμογών παλαιού τύπου σε αυτήν τη λίστα.\n\nΤμήματα ονομάτων κεντρικών υπολογιστών: Θα πρέπει να προσδιορίζονται είτε πλήρη ονόματα τομέων όπως το \"www.example.com\" είτε τμήματά τους όπως \"example.com: ή ακόμη \"example\". Δεν υποστηρίζονται ακόμη χαρακτήρες μπαλαντέρ.\nΠροθέματα διευθύνσεων URL: Μόνο τα κατάλληλα προθέματα διεύθυνσης URL αντιστοιχίζονται πλήρως με το πρωτόκολλο και τη θύρα εάν είναι απαραίτητο. Για παράδειγμα \"http://login.example.com\" ή \"https://www.example.com:8080/login/\".\n\nΕάν δεν προσδιοριστεί ή παραμείνει κενή, τυχόν τομείς που δεν ανήκουν στη λίστα \"Κεντρικοί υπολογιστές για άνοιγμα στο εναλλακτικό πρόγραμμα περιήγησης\" θα προκαλούν τη μετάβαση πίσω στο Firefox(*).\n\n*: Προς το παρόν μόνο ο Internet Explorer υποστηρίζει την αυτόματη επιστροφή στο Firefox.",
    "description": "Explanation of the URLGreyList policy"
  },
  "KeepLastFirefoxTab_Policy": {
    "message": "Διατήρηση τελευταίας καρτέλας Firefox κατά τη μετάβαση",
    "description": "Name of the KeepLastFirefoxTab policy"
  },
  "KeepLastFirefoxTab_Part": {
    "message": "Διατήρηση τελευταίας καρτέλας Firefox κατά τη μετάβαση",
    "description": "Name of the KeepLastFirefoxTab part"
  },
  "KeepLastFirefoxTab_Explain": {
    "message": "Σας δίνει τη δυνατότητα να προσδιορίσετε τι συμβαίνει όταν γίνεται ανακατεύθυνση της τελευταίας ανοικτής καρτέλας στο Firefox σε ένα εναλλακτικό πρόγραμμα περιήγησης.\n\nΌταν είναι ενεργοποιημένη αυτή η πολιτική ή δεν έχει οριστεί, η τελευταία ανοικτή καρτέλα θα παραμείνει ανοικτή και θα οδηγεί στη σελίδα σε νέα καρτέλα, μετά τη μετάβαση. Εάν η πολιτική απενεργοποιηθεί, η τελευταία καρτέλα θα κλείσει, με αποτέλεσμα το κλείσιμο του Firefox, εάν δεν υπάρχουν άλλα ανοικτά παράθυρα του Firefox.",
    "description": "Explanation of the KeepLastFirefoxTab policy"
  },
  "ShowTransitionScreen_Policy": {
    "description": "Name of the ShowTransitionScreen policy",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Part": {
    "description": "Name of the ShowTransitionScreen policy part",
    "message": "Show Transition Screen in Firefox For Some Time"
  },
  "ShowTransitionScreen_Explain": {
    "description": "Explanation of the ShowTransitionScreen policy",
    "message": "Allows you to specify how long the transition message in the tab will be visible in Firefox before transitioning to the other browser. This helps visualize the transition. The policy is specified in seconds.\n\nIf it is not set then the tab will be closed immediately when the transition can be completed."
  },
  "UseIeSiteList_Policy": {
    "description": "Name of the UseIeSiteList policy",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Part": {
    "description": "Name of the UseIeSiteList policy part",
    "message": "Use IE Enterprise Mode Site List Policy"
  },
  "UseIeSiteList_Explain": {
    "description": "Explanation of the UseIeSiteList policy",
    "message": "When enabled, transitions between browsers will also be triggered by entries in the SiteList policy for Internet Explorer as defined in (https://technet.microsoft.com/itpro/internet-explorer/ie11-deploy-guide/turn-on-enterprise-mode-and-use-a-site-list).\n\nIf it is not set or disabled then only the urls in the extension policy will be used."
  }
}
