{
  "SUPPORTED_WINXPSP2": {
    "message": "Microsoft Windows XP SP2 veya sonrası",
    "description": "States the fact that this policy is only supported on XP SP2 and above"
  },
  "Cat_Google": {
    "message": "Google",
    "description": "The general category in the Group Policy Editor"
  },
  "Cat_LegacyBrowserSupport": {
    "message": "Eski Tarayıcı Desteği",
    "description": "The specific category in the Group Policy Editor"
  },
  "AlternativeBrowserPath": {
    "message": "Alternatif Tarayıcı Yolu",
    "description": "Name of the AlternativeBrowserPath policy"
  },
  "AlternativeBrowserPath_Part": {
    "message": "Alternatif Tarayıcı Yolu",
    "description": "Name of the AlternativeBrowserPath policy part"
  },
  "AlternativeBrowserPath_Explain": {
    "message": "Alternatif tarayıcının yürütülebilir dosyasını belirtin.\nAlternatif tarayıcı olarak kullanılacak programı belirtmenize olanak verir.\n\nEtkinleştirilirse, politikada mutlak bir yol belirtebilir veya aşağıdaki değişkenlerden birini kullanabilirsiniz:\n\n$${ie} - Internet Explorer için varsayılan yükleme konumu\nBu örnekte, tarayıcının konumunu seçmek için HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\IEXPLORE.EXE kullanılmıştır.\n$${firefox} - Firefox için varsayılan yükleme konumu\nBu örnekte, tarayıcının konumunu seçmek için HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\FIREFOX.EXE kullanılmıştır.\n$${safari} - Safari için varsayılan yükleme konumu\nBu örnekte, tarayıcının konumunu seçmek için HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\SAFARI.EXE kullanılmıştır.\n\nPolitika etkinleştirilmezse veya boş bırakılırsa, varsayılan alternatif tarayıcı olan Internet Explorer kullanılır (sanki $${ie} değeri kullanılmış gibi düşünülür).",
    "description": "Explanation of the AlternativeBrowserPath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "AlternativeBrowserArguments": {
    "message": "Alternatif Tarayıcı Bağımsız Değişkenleri",
    "description": "Name of the AlternativeBrowserArguments policy"
  },
  "AlternativeBrowserArguments_Part": {
    "message": "Alternatif Tarayıcı Bağımsız Değişkenleri",
    "description": "Name of the AlternativeBrowserArguments policy part"
  },
  "AlternativeBrowserArguments_Explain": {
    "message": "Alternatif tarayıcının yürütülebilir dosyasına geçirilecek bağımsız değişkenleri belirtmenize olanak verir.\n\nPolitika etkinleştirilirse, alternatif tarayıcı çağrıldığında, sağlanan parametreler kullanılır.\n\nURL'nin, komut satırının neresinde görüneceğini belirtmek için özel yer tutucu olarak $${url} öğesini de kullanabilirsiniz. Ör. \"--url=$${url} --kiosk\".\nYer tutucu sona eklenecekse belirtilmesi gerekmez veya yer tutucu tek bağımsız değişken olacaksa ilgili politika boş bırakılabilir.\n\nPolitika devre dışı veya boş bırakılırsa, parametre olarak tarayıcıya sadece URL geçirilir.",
    "description": "Explanation of the AlternativeBrowserArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "ChromePath": {
    "message": "Chrome Yolu",
    "description": "Name of the ChromePath policy"
  },
  "ChromePath_Part": {
    "message": "Chrome Yolu",
    "description": "Name of the ChromePath policy part"
  },
  "ChromePath_Explain": {
    "message": "Alternatif tarayıcıdan geri dönüldüğünde başlatılacak Chrome yürütülebilir dosyasını belirtmenize olanak verir(*).\n\nPolitika etkinleştirildiğinde politikada mutlak bir yol belirtebilir veya aşağıdaki değişkeni kullanabilirsiniz:\n\n$${chrome} - Chrome için varsayılan yükleme konumu\nBu örnekte tarayıcının konumunu seçmek için HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\App Paths\\Chrome.EXE kullanılmıştır.\n\nPolitika devre dışı veya boş bırakılırsa, varsayılan Chrome yüklemesi kullanılır (sanki $${chrome} değeri kullanılmış gibi düşünülür).\n\n*: Chrome'a otomatik olarak geri dönme özelliğini şu anda sadece Internet Explorer desteklemektedir.",
    "description": "Explanation of the ChromePath policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "ChromeArguments": {
    "message": "Chrome Bağımsız Değişkenleri",
    "description": "Name of the ChromeArguments policy"
  },
  "ChromeArguments_Part": {
    "message": "Chrome Bağımsız Değişkenleri",
    "description": "Name of the ChromeArguments policy part"
  },
  "ChromeArguments_Explain": {
    "message": "Chrome yürütüldüğünde ona geçirilecek bağımsız değişkenleri belirtmemize olanak verir.\n\nPolitika etkinleştirilirse, Chrome çağrıldığında, sağlanan parametreler kullanılır.\n\nURL'nin, komut satırının neresinde görüneceğini belirtmek için özel yer tutucu olarak $${url} öğesini de kullanabilirsiniz. Ör. \"--url=$${url} --kiosk\"\nYer tutucu sona eklenecekse belirtilmesi gerekmez veya yer tutucu tek bağımsız değişken olacaksa ilgili politika boş bırakılabilir.\n\nPolitika devre dışı veya boş bırakılırsa, tarayıcıya parametre olarak sadece URL geçirilir.",
    "description": "Explanation of the ChromeArguments policy. Any ${TAG} should be left as is and not translated. Registry path should be left as is too."
  },
  "URLList_Policy": {
    "message": "Alternatif Tarayıcıda Açılacak Ana Makineler",
    "description": "Name of the URLList policy"
  },
  "URLList_Part": {
    "message": "Alternatif Tarayıcıda Açılacak Ana Makineler",
    "description": "Name of the URLList policy part"
  },
  "URLList_Explain": {
    "message": "Alternatif tarayıcıda açılacak ana makine alan adlarının listesini belirtmenize olanak verir.\n\nPolitika etkinleştirilmişse alternatif tarayıcıya geçişi tetikleyecek bir filtre listesi sağlamanız gerekir. Her giriş aşağıdaki dört türden birinde olmalıdır:\n\nAna makine adı bölümü: Alan adının tamamı (\"www.example.com\" gibi) veya bir kısmı (\"example.com\", hatta \"example\" gibi) belirtilmelidir. Joker karakterler henüz desteklenmemektedir.\nURL öneki: Gerekirse protokol ve bağlantı noktasıyla birlikte, sadece uygun URL önekleri tam olarak eşleştirilir. Ör. \"http://login.example.com\" veya \"https://www.example.com:8080/login/\".\nNegatif giriş: \"!\" ile başlar ve yukarıda açıklandığı gibi ana makine adı kısmıyla veya URL önekiyle devam eder. Negatif girişler her zaman Chrome'da açılır. Ör. \"!example.com\" veya \"!file:///c:/localapp/\".\nJoker karakter girişi: Sadece tek bir \"*\" karakteri içerir. Her URL ile eşleşir. Çoğu URL'nin alternatif tarayıcıda, az sayıda URL'nin ise Chrome'da açılacağı durumlarda, negatif girişlerle birlikte kullanılmak için tasarlanmıştır.\n\nNegatif girişler pozitif girişlere oranla daha yüksek önceliklere sahiptir. Bu da bir alan adının büyük bölümünün beyaz listeye eklenmesine olanak sağlarken, daha küçük kısmının Chrome'da açılmak üzere kaydedilmesine izin verir.\nJoker karakter girişi (varsa), ancak diğer tüm kurallar kontrol edildikten sonra uygulanır.\n\nYönlendirme için şu protokoller izlenir: http:, https:.\n\nBelirtilmezse veya boş bırakılırsa, alternatif tarayıcıya herhangi bir geçiş tetiklenmez.",
    "description": "Explanation of the URLList policy"
  },
  "URLGreyList_Policy": {
    "message": "Her İki Tarayıcıda Açılacak Ana Makineler",
    "description": "Name of the URLGreyList policy"
  },
  "URLGreyList_Part": {
    "message": "Her İki Tarayıcıda Açılacak Ana Makineler",
    "description": "Name of the URLGreyList policy part"
  },
  "URLGreyList_Explain": {
    "message": "Her iki tarayıcıda da açılacak ana makine alan adlarının listesini belirtmenize olanak verir.\n\nBu politika etkinleştirildiğinde, bu listedeki alan adları her iki tarayıcıda da kullanılabilir ve iki yönde de geçişi tetiklemez.\n\nOlası bir kullanım yeri, bu listedeki yeni ve eski uygulamalar arasında paylaşılan, kimlik doğrulama alan adlarıdır.\n\nAna makine adı bölümleri: Tam alan adları (\"www.example.com\" gibi) veya bu adlara ait bölümler (\"example.com: hatta \"example\" gibi) belirtilmelidir. Joker karakterler henüz desteklenmemektedir.\nURL önekleri: Gerekirse yalnızca uygun URL önekleri protokolle ve bağlantı noktasıyla tamamen eşleştirilir. Örneğin, \"http://login.example.com\" veya \"https://www.example.com:8080/login/\"\n\nBelirtilmez veya boş bırakılırsa, \"Alternatif Tarayıcıda Açılacak Ana Makineler\" listesinde bulunmayan alan adları tekrar Chrome'a geçişi tetikler(*).\n\n*: Chrome'a otomatik olarak geri dönme özelliği şu anda sadece Internet Explorer'da desteklenmektedir.",
    "description": "Explanation of the URLGreyList policy"
  },
  "KeepLastChromeTab_Policy": {
    "message": "Son Chrome Sekmesini Geçişte Sakla",
    "description": "Name of the KeepLastChromeTab policy"
  },
  "KeepLastChromeTab_Part": {
    "message": "Son Chrome Sekmesini Geçişte Sakla",
    "description": "Name of the KeepLastChromeTab part"
  },
  "KeepLastChromeTab_Explain": {
    "message": "Chrome'da açık olan son sekme alternatif tarayıcıya yönlendirildiğinde ne olacağını belirtmenize olanak verir.\n\nPolitika etkinleştirildiğinde veya hiç ayarlanmadığında, son sekme açık kalır ve geçişten sonra yeni sekme sayfasına işaret eder. Devre dışı olarak ayarlanırsa son sekme kapatılır ve bu da, açık durumda başka Chrome penceresi yoksa Chrome'u kapatır.",
    "description": "Explanation of the KeepLastChromeTab policy"
  }
}